{
  "sections": [
    {
      "title": "Content Sectioning",
      "description": "Content sectioning elements allow you to organize the document content into logical pieces. Use the sectioning elements to create a broad outline for your page content, including header and footer navigation, and heading elements to identify sections of content.",
      "examples": [
        {
          "title": "Headings",
          "description": "The HTML <h1>–<h6> elements represent six levels of section headings. <h1> is the highest section level and <h6> is the lowest.",
          "markup": "<h1>Heading level 1</h1><h2>Heading level 2</h2><h3>Heading level 3</h3><h4>Heading level 4</h4><h5>Heading level 5</h5><h6>Heading level 6</h6>"
        },
        {
          "title": "<hgroup>",
          "description": "The HTML <hgroup> element represents a multi-level heading for a section of a document. It groups a set of <h1>–<h6> elements.",
          "markup": "<hgroup><h1>HTML</h1><h2>Living Standard — Last Updated 12 August 2016</h2></hgroup>"
        }
      ]
    },
    {
      "title": "Text content",
      "description": "Use HTML text content elements to organize blocks or sections of content placed between the opening <body> and closing </body> tags. Important for accessibility and SEO, these elements identify the purpose or structure of that content.",
      "examples": [
        {
          "title": "<blockquote>",
          "description": "The HTML <blockquote> Element (or HTML Block Quotation Element) indicates that the enclosed text is an extended quotation. Usually, this is rendered visually by indentation (see Notes for how to change it). A URL for the source of the quotation may be given using the cite attribute, while a text representation of the source can be given using the <cite> element.",
          "markup": "<blockquote cite='https://tools.ietf.org/html/rfc1149'> <p>Avian carriers can provide high delay, low throughput, and low altitude service.  The connection topology is limited to a single point-to-point path for each carrier, used with standard carriers, but many carriers can be used without significant interference with each other, outside of early spring.  This is because of the 3D ether space available to the carriers, in contrast to the 1D ether used by IEEE802.3.  The carriers have an intrinsic collision avoidance system, which increases availability.</p></blockquote>"
        },
        {
          "title": "Definition List",
          "description": "The HTML <dd> element provides the details about or the definition of the preceding term (<dt>) in a description list (<dl>).",
          "markup": "<dl><dt>Firefox</dt><dd>  A free, open source, cross-platform,  graphical web browser developed by the  Mozilla Corporation and hundreds of  volunteers.</dd><!-- Other terms and descriptions --></dl>"
        },
        {
          "title": "<figcaption>",
          "description": "The HTML <figcaption> element represents a caption or a legend associated with a figure or an illustration described by the rest of the data of the <figure> element which is its immediate ancestor.",
          "markup": "<figcaption>",
          "preview": "<figcaption>Example Text</figcaption>"
        },
        {
          "title": "<figure>",
          "description": "The HTML <figure> element represents self-contained content, frequently with a caption (<figcaption>), and is typically referenced as a single unit.",
          "markup": "<figure>",
          "preview": "<figure>Example Text</figure>"
        },
        {
          "title": "<hr>",
          "description": "The HTML <hr> element represents a thematic break between paragraph-level elements (for example, a change of scene in a story, or a shift of topic with a section); historically, this has been presented as a horizontal rule or line.",
          "markup": "<hr>",
          "preview": "<hr>"
        },
        {
          "title": "<main>",
          "description": "The HTML <main> element represents the dominant content of the <body> of a document, portion of a document or application. The main content area consists of content that is directly related to or expands upon the central topic of a document, or the central functionality of an application.",
          "markup": "<main>",
          "preview": "<main>Example Text</main>"
        },
        {
          "title": "<p>",
          "description": "The HTML <p> element represents a paragraph of text.",
          "markup": "<p>",
          "preview": "<p>Example Text</p>"
        },
        {
          "title": "<pre>",
          "description": "The HTML <pre> element represents preformatted text which is to be presented exactly as written in the HTML file.",
          "markup": "<pre>",
          "preview": "<pre>Example Text</pre>"
        },
        {
          "title": "Lists",
          "description": "The HTML <ul> element represents an unordered list of items, typically rendered as a bulleted list.",
          "markup": "<ul>, <ol>, <li>",
          "preview": "<ul><li>List item 1</li><li>List item 2</li><li>List item 3</li></ul><br><ol><li>List item 1</li><li>List item 2</li><li>List item 3</li></ol>"
        }
      ]
    }
  ]
}
